README.tex
% Created 2021-12-05 Sun 17:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Ian Waudby-Smith}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Ian Waudby-Smith},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Zero to Hero: XSEDE, PSC, and Bridges}
\label{zero-to-hero-xsede-psc-and-bridges}
\subsection{Account setup}
\label{account-setup}
\subsubsection{Creating account}
\label{creating-account}
If you do not already have an XSEDE account, you can create one
\href{https://portal.xsede.org/my-xsede?p\_p\_id=58\&p\_p\_lifecycle=0\&p\_p\_state=maximized\&p\_p\_mode=view\&\_58\_struts\_action=\%2Flogin\%2Fcreate\_account}{here}.

\subsubsection{Requesting an allocation}
\label{requesting-an-allocation}
TODO

\subsubsection{Getting added to an allocation}
\label{getting-added-to-an-allocation}
To use compute resources, you will need to be added to an XSEDE
allocation. Your PI and/or allocation manager can add you as a user to a
specific project
\href{https://portal.xsede.org/group/xup/add-remove-user}{here}.

\subsection{Running your first job}
\label{running-your-first-job}
\subsubsection{Logging into Bridges2/PSC via \texttt{ssh}}
\label{logging-into-bridges2psc-via-ssh}
Start by =ssh=ing into the bridges2 server at port 2222:

\begin{verbatim}
ssh -p 2222 <username>@bridges2.psc.edu
\end{verbatim}

You will be prompted for your XSEDE credentials. Use your XSEDE User
Portal password.

\textbf{\emph{Tip:}} TODO Add tip about .bashrc etc.

\textbf{\emph{Warning:}} TODO add warning about randomness when parallelizing

\subsubsection{Creating a Slurm job script}
\label{creating-a-slurm-job-script}
Bridges-2 uses a job-scheduling system called ``Slurm'', providing a way
for users like ourselves to request specific resources for our compute
jobs and automatically launch jobs once said resources have become
available.

Jobs are submitted using the \texttt{sbatch} command along with a \textbf{batch
script} which we will create. These batch scripts take the following
general form.

\begin{verbatim}
#!/bin/bash

### REQUEST RESOURCES ###
#SBATCH -arg1 argument1
#SBATCH -arg2 argument2 
# .
# .
# .
#SBATCH -arg3 argument3

### LOAD MODULES ###
module load some_module

### RUN SCRIPTS ###
python myscript.py
Rscript myscript.R
\end{verbatim}

\subsubsection{Parallel computation}
\label{parallel-computation}
\begin{enumerate}
\item \href{examples/python/python\_parallel/README.md}{Python}
\label{python}
\item \href{examples/R/R\_parallel/README.md}{R}
\label{r}
\end{enumerate}
\subsection{Advanced}
\label{advanced}
TODO
\end{document}
